hello-user = Привет, { $username }. Выберите действие.

button-button = Найти допуск размера
button-transition_map = Найти аналог ОССТ допуска.

button-pressed = Вы нажали на кнопку

no-copy = Данный тип апдейтов не поддерживается методом send_copy

text-method1 = Введите значение допуска в формате 20H7

tolerance-answer =
    верхнее отклонение = {$upper}
    нижнее отклонение = {$lower}
    макс. размер = {$max}
    <b>средний размер = {$avg}</b>
    мин. размер = {$min}

next-step = Дальше вы можете:

ContinueAction-step = Продолжить

back-step = Вернуться

### Map tolerance texts

map-tolerance-invite_text = Введите наименование допуска в система ОССТ.
map-tolerance-found_text = Найдены следующие соответствия допусков: {$list}.

### Обработка ошибок

messages-tolerance_unavailable = ❌ Допуск не существует.
messages-dimension_unavailable = ❌ Для данного размера допуск не существует {$target_value}.
messages-deviation_unavailable = ❌ Для данного допуска не существует такого размера.
messages-wrong_value = Некорректный ввод, попробуйте еще раз.
messages-wrong_tolerance_format = ⚠️ Неправильный формат допуска {$name}.

messages-old_tolerance_unavailable = ❌ ОССТ допуск не существует.
messages-old_tolerance_relations_unavailable = ❌Для ОССТ допуска не существует аналогов.

errors-not_found = ❌ Не найдено: { $name }
errors-conflict = ⚠️ Конфликт: { $name }
errors-unauthorized = 🔒 Нет доступа: { $name }
errors-forbidden = 🚫 Запрещено: { $name }
errors-bad_request = ⚠️ Неверный запрос: { $name }
errors-unavailable_service = ⚠️ Сервис недоступен: { $name }
errors-validation_error = ⚠️ Ошибка валидации: { $name }
errors-unexpected_error = 🚨 Произошла непредвиденная ошибка, пожалуйста, попробуйте снова.